Table of Contents
 Class TemperatureCurve2D
Namespace
IdeaRS.OpenModel.Geometry2D
Assembly
IdeaRS.OpenModel.dll
Reperesents a thermal curve.
[OpenModelClass("CI.Geometry2D.TemperatureCurve2D,CI.Geometry2D")]
public class TemperatureCurve2D : Polygon2D
Inheritance
object
OpenObject
Polygon2D
TemperatureCurve2D
Inherited Members
 Polygon2D.Points
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 TemperatureCurve2D()
Constructor
public TemperatureCurve2D()
Properties
 Temperature
The temperature [K]
public double Temperature { get; set; }
Property Value
double
 Edit this page